# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\alexport\OneDrive - Safeguard Analytics\SA-220\SA-220.cydsn\SA-220.cyprj
# Date: Tue, 14 Oct 2025 15:22:15 GMT
#set_units -time ns
create_clock -name {I2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {ModbusUART_SCBCLK(FFB)} -period 10416.666666666666 -waveform {0 5208.33333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock_1(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_7}] [get_pins {ClockBlock/ff_div_8}] [get_pins {ClockBlock/ff_div_9}] [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]
create_generated_clock -name {UART2_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {ModbusUART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 501 1001} -nominal_period 10416.666666666666 [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list]


# Component constraints for C:\Users\alexport\OneDrive - Safeguard Analytics\SA-220\SA-220.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\alexport\OneDrive - Safeguard Analytics\SA-220\SA-220.cydsn\SA-220.cyprj
# Date: Tue, 14 Oct 2025 15:22:10 GMT
